Books_And_Tutorials/cpp/boost/boost_functionalities.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Boost Functionalities </title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-12-26 10:55:43 "/>
<meta name="author" content=""/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">Boost Functionalities </h1>


<meta http-equiv="Content-Style-Type" content="text/css">
<link rel="stylesheet" href="../../../css/org-style.css" type="text/css" />
<style type="text/css"/><!--
  pre.display { font-family:inherit }
  pre.format  { font-family:inherit }
  pre.smalldisplay { font-family:inherit; font-size:smaller }
  pre.smallformat  { font-family:inherit; font-size:smaller }
  pre.smallexample { font-size:smaller }
  pre.smalllisp    { font-size:smaller }
  span.sc    { font-variant:small-caps }
  span.roman { font-family:serif; font-weight:normal; } 
  span.sansserif { font-family:sans-serif; font-weight:normal; } 
--></style>
<div id="postamble">
<p class="author"> Author: Pralay Patoria
<a href="mailto:ppatoria@gmail.com">&lt;ppatoria@gmail.com&gt;</a>
</p>
<p class="date"> Date: 24-12-2013</p>
</div>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 type casting </a>
<ul>
<li><a href="#sec-1_1">1.1 <code>lexical_cast</code>     : converts string to integer. </a></li>
<li><a href="#sec-1_2">1.2 <code>numeric_cast</code>     : converts integer to string. </a></li>
<li><a href="#sec-1_3">1.3 <code>polymorphic_cast</code> : wrapper over dynamic cast . check the object is not null and does <code>dynamic_cast</code> . </a></li>
</ul>
</li>
<li><a href="#sec-2">2 bind </a></li>
<li><a href="#sec-3">3 lambda </a></li>
<li><a href="#sec-4">4 Any </a></li>
<li><a href="#sec-5">5 Array </a></li>
<li><a href="#sec-6">6 Smartpointers: </a>
<ul>
<li><a href="#sec-6_1">6.1 <code>scoped_ptr</code>    : scope ptr similar to <code>auto_ptr</code> without transfer of ownership. </a></li>
<li><a href="#sec-6_2">6.2 <code>shared_ptr</code>    : multiple pointers can share a memory resource. Internally uses reference couting. </a></li>
<li><a href="#sec-6_3">6.3 <code>intrusive_ptr</code> : similar to shared<sub>ptr</sub> only difference is that reference counting need to be handled explicitly by user i.e. user can have custom refrence counting. </a></li>
<li><a href="#sec-6_4">6.4 <code>weak_ptr</code>      : to eliminate issue related to acyclic refrence when <code>shared_ptr</code> are used. </a></li>
<li><a href="#sec-6_5">6.5 <code>auto_ptr</code> (stl): similar to scoped pointer with transfer of ownership. </a></li>
<li><a href="#sec-6_6">6.6 <code>unique_ptr</code>    : similar to <code>auto_ptr</code> but transfer of ownership is not implicit. User have to use stl:move to transfer the ownership. </a></li>
</ul>
</li>
<li><a href="#sec-7">7 Threading: </a>
<ul>
<li><a href="#sec-7_1">7.1 <b>thread</b> :  if not detached after spawning calls stl::terminate and the program is terminated. </a>
<ul>
<li><a href="#sec-7_1_1">7.1.1 <b>detach</b> : detach from the thread before goes out of scope and destructer is called. </a></li>
<li><a href="#sec-7_1_2">7.1.2 <b>join</b>   : join before going out of scope and destructer is called. </a></li>
</ul>
</li>
<li><a href="#sec-7_2">7.2 <code>scoped_thread</code> :(RAII) is a scoped thread and it either gets detached or join or interuppted. </a>
<ul>
<li><a href="#sec-7_2_1">7.2.1 <code>interuppt_and_join_if_joinable</code> </a></li>
<li><a href="#sec-7_2_2">7.2.2 <code>join_if_joinable</code> </a></li>
<li><a href="#sec-7_2_3">7.2.3 detach </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-8">8 synchronization objects </a>
<ul>
<li><a href="#sec-8_1">8.1 mutex </a></li>
<li><a href="#sec-8_2">8.2 recursive<sub>mutex</sub> </a></li>
<li><a href="#sec-8_3">8.3 <code>shared_mutex</code>: read only lock shared between all the threads who are using <code>shared_mutex</code>. </a></li>
<li><a href="#sec-8_4">8.4 <code>conditional_variable</code> : have method <code>notify_one</code> and <code>notify_all</code>. used in conjunction with bool conditional variable. </a></li>
</ul>
</li>
<li><a href="#sec-9">9 locks </a>
<ul>
<li><a href="#sec-9_1">9.1 <code>lock_quard</code> : RAII </a></li>
<li><a href="#sec-9_2">9.2 <code>unique_quard</code> </a></li>
<li><a href="#sec-9_3">9.3 atomic </a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> type casting </h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1_1" class="outline-3">
<h3 id="sec-1_1"><span class="section-number-3">1.1</span> <code>lexical_cast</code>     : converts string to integer. </h3>
<div class="outline-text-3" id="text-1_1">

</div>

</div>

<div id="outline-container-1_2" class="outline-3">
<h3 id="sec-1_2"><span class="section-number-3">1.2</span> <code>numeric_cast</code>     : converts integer to string. </h3>
<div class="outline-text-3" id="text-1_2">

</div>

</div>

<div id="outline-container-1_3" class="outline-3">
<h3 id="sec-1_3"><span class="section-number-3">1.3</span> <code>polymorphic_cast</code> : wrapper over dynamic cast . check the object is not null and does <code>dynamic_cast</code> . </h3>
<div class="outline-text-3" id="text-1_3">


</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> bind </h2>
<div class="outline-text-2" id="text-2">

<ul>
<li>
bind the fundtion and parameters and returns functors. Used while passing function as parameter.

</li>
</ul>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> lambda </h2>
<div class="outline-text-2" id="text-3">

<ul>
<li>
<b>labda expression:</b> passing lamda expression as parameter.

</li>
</ul>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Any </h2>
<div class="outline-text-2" id="text-4">


</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Array </h2>
<div class="outline-text-2" id="text-5">


</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Smartpointers: </h2>
<div class="outline-text-2" id="text-6">

<ul>
<li>
Handles deallocation and exception.

</li>
</ul>

</div>

<div id="outline-container-6_1" class="outline-3">
<h3 id="sec-6_1"><span class="section-number-3">6.1</span> <code>scoped_ptr</code>    : scope ptr similar to <code>auto_ptr</code> without transfer of ownership. </h3>
<div class="outline-text-3" id="text-6_1">

</div>

</div>

<div id="outline-container-6_2" class="outline-3">
<h3 id="sec-6_2"><span class="section-number-3">6.2</span> <code>shared_ptr</code>    : multiple pointers can share a memory resource. Internally uses reference couting. </h3>
<div class="outline-text-3" id="text-6_2">

</div>

</div>

<div id="outline-container-6_3" class="outline-3">
<h3 id="sec-6_3"><span class="section-number-3">6.3</span> <code>intrusive_ptr</code> : similar to shared<sub>ptr</sub> only difference is that reference counting need to be handled explicitly by user i.e. user can have custom refrence counting. </h3>
<div class="outline-text-3" id="text-6_3">

</div>

</div>

<div id="outline-container-6_4" class="outline-3">
<h3 id="sec-6_4"><span class="section-number-3">6.4</span> <code>weak_ptr</code>      : to eliminate issue related to acyclic refrence when <code>shared_ptr</code> are used. </h3>
<div class="outline-text-3" id="text-6_4">

</div>

</div>

<div id="outline-container-6_5" class="outline-3">
<h3 id="sec-6_5"><span class="section-number-3">6.5</span> <code>auto_ptr</code> (stl): similar to scoped pointer with transfer of ownership. </h3>
<div class="outline-text-3" id="text-6_5">

</div>

</div>

<div id="outline-container-6_6" class="outline-3">
<h3 id="sec-6_6"><span class="section-number-3">6.6</span> <code>unique_ptr</code>    : similar to <code>auto_ptr</code> but transfer of ownership is not implicit. User have to use stl:move to transfer the ownership. </h3>
<div class="outline-text-3" id="text-6_6">

<p>Reference: <a href="../smartpointers/smartpointers.html">Smart Pointers in C++</a>
</p>

</div>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Threading: </h2>
<div class="outline-text-2" id="text-7">


</div>

<div id="outline-container-7_1" class="outline-3">
<h3 id="sec-7_1"><span class="section-number-3">7.1</span> <b>thread</b> :  if not detached after spawning calls stl::terminate and the program is terminated. </h3>
<div class="outline-text-3" id="text-7_1">


</div>

<div id="outline-container-7_1_1" class="outline-4">
<h4 id="sec-7_1_1"><span class="section-number-4">7.1.1</span> <b>detach</b> : detach from the thread before goes out of scope and destructer is called. </h4>
<div class="outline-text-4" id="text-7_1_1">

</div>

</div>

<div id="outline-container-7_1_2" class="outline-4">
<h4 id="sec-7_1_2"><span class="section-number-4">7.1.2</span> <b>join</b>   : join before going out of scope and destructer is called. </h4>
<div class="outline-text-4" id="text-7_1_2">


</div>
</div>

</div>

<div id="outline-container-7_2" class="outline-3">
<h3 id="sec-7_2"><span class="section-number-3">7.2</span> <code>scoped_thread</code> :(RAII) is a scoped thread and it either gets detached or join or interuppted. </h3>
<div class="outline-text-3" id="text-7_2">


</div>

<div id="outline-container-7_2_1" class="outline-4">
<h4 id="sec-7_2_1"><span class="section-number-4">7.2.1</span> <code>interuppt_and_join_if_joinable</code> </h4>
<div class="outline-text-4" id="text-7_2_1">

</div>

</div>

<div id="outline-container-7_2_2" class="outline-4">
<h4 id="sec-7_2_2"><span class="section-number-4">7.2.2</span> <code>join_if_joinable</code> </h4>
<div class="outline-text-4" id="text-7_2_2">

</div>

</div>

<div id="outline-container-7_2_3" class="outline-4">
<h4 id="sec-7_2_3"><span class="section-number-4">7.2.3</span> detach </h4>
<div class="outline-text-4" id="text-7_2_3">


</div>
</div>
</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> synchronization objects </h2>
<div class="outline-text-2" id="text-8">


</div>

<div id="outline-container-8_1" class="outline-3">
<h3 id="sec-8_1"><span class="section-number-3">8.1</span> mutex </h3>
<div class="outline-text-3" id="text-8_1">

</div>

</div>

<div id="outline-container-8_2" class="outline-3">
<h3 id="sec-8_2"><span class="section-number-3">8.2</span> recursive<sub>mutex</sub> </h3>
<div class="outline-text-3" id="text-8_2">

</div>

</div>

<div id="outline-container-8_3" class="outline-3">
<h3 id="sec-8_3"><span class="section-number-3">8.3</span> <code>shared_mutex</code>: read only lock shared between all the threads who are using <code>shared_mutex</code>. </h3>
<div class="outline-text-3" id="text-8_3">

</div>

</div>

<div id="outline-container-8_4" class="outline-3">
<h3 id="sec-8_4"><span class="section-number-3">8.4</span> <code>conditional_variable</code> : have method <code>notify_one</code> and <code>notify_all</code>. used in conjunction with bool conditional variable. </h3>
<div class="outline-text-3" id="text-8_4">


</div>
</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> locks </h2>
<div class="outline-text-2" id="text-9">


</div>

<div id="outline-container-9_1" class="outline-3">
<h3 id="sec-9_1"><span class="section-number-3">9.1</span> <code>lock_quard</code> : RAII </h3>
<div class="outline-text-3" id="text-9_1">

</div>

</div>

<div id="outline-container-9_2" class="outline-3">
<h3 id="sec-9_2"><span class="section-number-3">9.2</span> <code>unique_quard</code> </h3>
<div class="outline-text-3" id="text-9_2">

</div>

</div>

<div id="outline-container-9_3" class="outline-3">
<h3 id="sec-9_3"><span class="section-number-3">9.3</span> atomic </h3>
<div class="outline-text-3" id="text-9_3">



</div>
</div>
</div>
<div id="postamble">
<p class="date"> Date: 2013-12-26 10:55:43 </p>
</div>
</div>
</body>
</html>
